app/views/carts/show.html.erb

SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 24]]
---
<ul>
	<% @cart.join_table_cart_items.each do |join| %>