app/views/items/index.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 24], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 24], ["created_at", "2019-09-04 17:49:13.327330"], ["updated_at", "2019-09-04 17:49:13.327330"]]
---
  <!-- find if currend_user has a cart else it create a cart for the user -->
	<% cart = Cart.find_by(user_id:current_user.id)
		if !cart
			Cart.create(user_id:current_user.id)

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 24], ["LIMIT", 1]]
---
	%>
	<a href="<%=cart_path(Cart.find_by(user_id:current_user.id ))%>">mon panier</a>