app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 24]]
---
  def show
    @cart = Cart.find(params[:id])
    def sum
      sum = 0
        for i in (0..@cart.join_table_cart_items.length-1)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @item = Item.find(params[:item_id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find_by(id: session[:cart_id]) || Cart.create