app/controllers/join_table_cart_items_controller.rb

  def create
    item = Item.find(params['data_value'])
    @cart = Cart.find_by(user_id:current_user.id)
    if_item_exist = @cart.join_table_cart_items.find_by(item_id: item.id)

    if !if_item_exist
      @join_table_cart_items = @cart.join_table_cart_items.new(item: item)
      respond_to do |format|
        if @join_table_cart_items.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 24], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1 AND "join_table_cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 24], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "join_table_cart_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 1], ["cart_id", 24], ["created_at", "2019-09-04 17:49:25.835027"], ["updated_at", "2019-09-04 17:49:25.835027"]]

  def set_cart
    @cart = Cart.find_by(id: session[:cart_id]) || Cart.create
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]